frontend/controllers/BaseController.php

SELECT `avatar`, `name`, `short_text`, `facebook`, `twitter`, `googleplus`, `instagram`, `linkedin` FROM `rs_about`
---
        Yii::$app->view->params['links'] = \frontend\models\Link::getAll();
        # about
        $about = new \yii\db\Query();
        Yii::$app->view->params['about'] = $about->select('avatar,name,short_text,facebook,twitter,googleplus,instagram,linkedin')->from(\frontend\models\About::tableName())->one();