frontend/controllers/SiteController.php

    public function actionIndex()
    {
        $query = new \yii\db\Query();

        $posTable = \frontend\models\Post::tableName();
        $userTable = \common\models\User::tableName();
        $commentTable = \frontend\models\Comment::tableName();
        $postCategoryTable = \frontend\models\PostCategory::tableName();

        // update posts status
        $query->createCommand()->update($posTable,['status' => 1],"status = 2 AND created_at <=" . time())->execute();
---
UPDATE `rs_post` SET `status`=1 WHERE status = 2 AND create_time <=1497959385