common/models/Visitors.php

INSERT INTO `rs_visitors` (`visit_date`, `group_date`, `ip`, `location`, `browser`, `os`, `referer`) VALUES (1498131577, 13960401, '192.168.51.1', 'http://php/raspina/', 'Chrome 58.0.3029.110', 'Windows', NULL)
---
    public function add()
    {
        if(!$this::isBot())
        {
            $time = time();
            $visitor = new Visitors();
            $visitor->visit_date = $time;
            $visitor->group_date = (int)Yii::$app->date->pdate($time,'YMMdd');
            $visitor->ip = $_SERVER['REMOTE_ADDR'];
            $visitor->location = "http://$_SERVER[HTTP_HOST]$_SERVER[REQUEST_URI]";
            $visitor->browser = Yii::$app->browser->getBrowser() . ' ' . Yii::$app->browser->getVersion();
            $visitor->os = Yii::$app->browser->getPlatform();
            $visitor->referer = isset($_SERVER['HTTP_REFERER']) ? $_SERVER['HTTP_REFERER'] : null;
            $visitor->save();