frontend/models/Category.php

SELECT * FROM `rs_category`
---
    public static function getAll()
    {
        return \yii\helpers\ArrayHelper::map(self::find()->all(),'id','title');