frontend/models/Link.php

    public static function getAll()
    {
        return self::find()->orderBy("id DESC")->all();
---
SELECT * FROM `rs_link` ORDER BY `id` DESC